---
type: EnergyAnalysisConstruction
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 11
tags: [revit-api, class]
---

# EnergyAnalysisConstruction

`Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetMaterialIds | — | `` |
| Method | GetMaterialIds | 2024 | `public IList < ElementId > GetMaterialIds ()` |
| Property | Absorptance | 2024 | `public double Absorptance { get ; }` |
| Property | ConstructionName | 2024 | `public string ConstructionName { get ; }` |
| Property | Description | 2024 | `public string Description { get ; }` |
| Property | HeatTransferCoefficient | 2024 | `public double HeatTransferCoefficient { get ; }` |
| Property | IsSchematic | 2024 | `public bool IsSchematic { get ; }` |
| Property | Parameter | — | `` |
| Property | Roughness | 2024 | `public int Roughness { get ; }` |
| Property | ThermalMass | 2024 | `public double ThermalMass { get ; }` |
| Property | ThermalResistance | 2024 | `public double ThermalResistance { get ; }` |